{
    "title": "Portfolio",
    "home": "Home",
    "work_experience": "Work Experience",
    "education": "Education",
    "tech_stack": "Tech Stack",
    "courses": "Courses",
    "certifications": "Certifications",
    "contact": "Contact",
    "profile_name": "Alberto Hernández Lado",
    "profile_role": "BACKEND DEVELOPER",
    "profile_description_1": "I am a backend developer with two years of experience in <strong>Java</strong> and <strong>Spring Boot</strong>, specializing in the design and development of scalable web applications and <strong>RESTful</strong> services. Throughout my career, I have worked with both <strong>monolithic</strong> and <strong>microservices</strong> architectures, designing efficient and scalable systems while prioritizing clean and documented code, following best practices to ensure sustainable long-term development.",
    "profile_description_2": "Recently, I have expanded my knowledge into the <strong>DevOps</strong> field to better understand the full software development lifecycle, from coding to deployment. I am acquiring skills in <strong>Docker</strong> and <strong>Kubernetes</strong> for container management and orchestration, as well as automating <strong>CI/CD pipelines</strong> to facilitate continuous integration and delivery.",
    "profile_description_3": "I have started working with cloud platforms such as <strong>Azure</strong>, where I have deployed and managed services in cloud environments. My goal is to integrate cloud-based solutions into future projects to build highly scalable and resilient systems.",
    "profile_description_4": "I am focused on continuing to specialize in the design of microservices-based systems and implementing automated solutions that optimize both the quality and efficiency of software. I am motivated to collaborate in dynamic teams and participate in innovative projects, while continuously learning and staying up to date with the latest technological advancements.",
    "work_experience_header": "Work Experience",
    "experience_1_company": "imaxin|software",
    "experience_1_role": "Software Analyst",
    "experience_1_date": "03/2024 - Present",
    "experience_1_task_1": "Develop and implement web applications and RESTful services for machine translation and natural language processing.",
    "experience_1_task_2": "Designed and implemented a distributed system with RESTful services developed in Java Spring Boot and Python scripts dedicated to document translation using neural machine translation models.",
    "experience_1_task_3": "Developed the logic for a language learning platform for the University of Santiago de Compostela, implementing a dynamic evaluation system with progressively difficult exercises. The use of PostgreSQL, required by the client, posed an additional challenge for the flexible structure of these exercises.",
    "experience_1_task_4": "Migrated legacy applications to Java Spring Boot using reverse engineering techniques.",
    "experience_1_task_5": "Introduced continuous integration with GitLab CI, implementing a pipeline to optimize project delivery processes.",
    "experience_1_task_6": "Planned and estimated technical tasks to improve project management efficiency.",
    "experience_2_date": "09/2023 - 03/2024",
    "experience_2_company": "NTT Data Europe & Latam",
    "experience_2_role": "Full Stack Developer",
    "experience_2_task_1": "Collaborated in the digital modernization of the Andalusian Digital Agency, working on complex web applications with an extensive data domain.",
    "experience_2_task_2": "Developed applications with Spring Boot Java, both in monolithic and microservices architectures, and implemented SOA solutions. Also, used Python for task automation, optimizing processes.",
    "experience_2_task_3": "Deployed applications in WildFly and managed version control using GitFlow, improving deployment pipelines and version management.",
    "experience_2_task_4": "Enhanced time management skills by breaking down complex tasks into concrete steps, ensuring timely deliveries.",
    "experience_2_task_5": "Mentored junior developers, reviewing code and providing technical support, strengthening leadership and communication skills.",
    "experience_3_date": "01/2023 - 06/2023",
    "experience_3_company": "NTT Data Europe & Latam",
    "experience_3_role": "Full Stack Developer",
    "experience_3_task_1": "Developed the internal communication system for the Andalusian Government with Java, JPA, and Spring for the backend, and JavaScript and HTML for the frontend.",
    "experience_3_task_2": "Resolved technical user issues, ensuring the continuous operation of the system.",
    "education_header": "Education",
    "education_1_university": "Universidad de Huelva",
    "education_1_degree": "Bachelor's in Computer Engineering",
    "education_1_date": "09/2018 - 09/2023",
    "education_2_university": "Politechnika Wrocławska",
    "education_2_degree": "Bachelor's in Computer Engineering",
    "education_2_date": "09/2021 - 06/2022",
    "tech_stack_header": "Technologies",
    "frameworks": "Frameworks",
    "spring_boot_description": "With Spring Boot, I have developed scalable microservices and monolithic applications, utilizing dependency injection, Spring Data JPA, and Spring Security for secure and modular solutions. I have also integrated Spring Cloud for cloud-native architectures and used Maven as a project manager.",
    "node_js_description": "I worked with Node.js, Express.js, and Mongoose during my final degree project, developing web applications and APIs. I plan to further explore Node.js in the future.",
    "coding_languages": "Programming Languages",
    "java_description": "Specialized in backend development with Java, I have worked with multiple versions of the language, optimizing performance and designing REST APIs with Object-Oriented Programming.",
    "python_description": "I used Python for scripting, automation, and neural networks, working with libraries such as TensorFlow, PyTorch, Pandas, and NumPy.",
    "javascript_description": "I created dynamic web applications with JavaScript and TypeScript, enhancing user experience across different platforms.",
    "frontend_tools": "Frontend Tools",
    "html5_description": "I used HTML5 to structure web application content, applying proper semantics to improve accessibility, SEO, and code maintainability.",
    "css3_description": "I employed CSS3 to design and style user interfaces, creating attractive and responsive user experiences using modern techniques like Flexbox and Grid for adaptability across devices of different resolutions.",
    "thymeleaf_description": "I integrated Thymeleaf as a template engine in Spring applications, facilitating dynamic content generation in the interface, maintaining a clear separation between business logic and presentation, and improving the efficiency of page rendering.",
    "database_management_systems": "Database Management Systems",
    "mysql_description": "I designed database schemas and optimized complex queries in MySQL for high-performance applications.",
    "oracle_description": "I managed databases with Oracle, working with complex schemas and advanced queries.",
    "postgresql_description": "I created scalable databases with PostgreSQL, focusing on performance and data integrity.",
    "mongodb_description": "I designed NoSQL solutions with MongoDB for unstructured data, optimizing queries and scalability.",
    "version_control_tools": "Version Control Tools",
    "git_description": "I managed repositories and branches with Git, implementing Gitflow to structure branching and automate processes.",
    "subversion_description": "I maintained code repositories with Subversion in legacy projects.",
    "ci_cd": "CI/CD",
    "gitlab_ci_description": "I automated integration and deployment pipelines with GitLab CI/CD.",
    "github_actions_description": "I configured GitHub Actions to automate testing and deployments in personal projects.",
    "containerization_and_orchestration": "Containerization and Orchestration",
    "docker_description": "I containerized applications with Docker to ensure consistency across environments and optimize local development.",
    "kubernetes_description": "I orchestrated dockerized applications with Kubernetes, improving scalability and resource management.",
    "testing_tools": "Testing Tools",
    "junit_description": "I developed unit tests with JUnit, automating them within the build pipeline.",
    "selenium_description": "I automated integration tests for web applications with Selenium WebDriver.",
    "jmeter_description": "I performed load testing with JMeter, evaluating application performance and generating detailed reports.",
    "cloud_platforms": "Cloud Platforms",
    "azure_description": "I learned Microsoft Azure concepts to integrate and deploy services in the cloud.",
    "repository_hosting_platforms": "Repository Hosting Platforms",
    "github_description": "I used GitHub to host repositories and configure CI/CD pipelines in personal projects.",
    "gitlab_description": "I managed repositories and CI/CD pipelines in professional projects with GitLab.",
    "project_management_tools": "Project Management Tools",
    "jira_description": "I used Jira to log the hours worked on each task, manage the task status throughout the project lifecycle, and generate periodic progress reports, ensuring deadlines were met as planned.",
    "easyredmine_description": "With Easy Redmine, I managed the time spent on each task by assigning hours and tracking progress. I also set up progress reports to ensure projects remained on schedule.",
    "miscellaneous_tools": "Other tools",
    "bash_description": "I automated tasks with Bash/Shell, managing configurations and deployments on Linux systems like Ubuntu and CentOS.",
    "postman_description": "I used Postman to test, debug, and automate API testing, ensuring that endpoints met functional and performance requirements before deployment.",
    "courses_header": "Courses",
    "course_1_title": "Spring Boot Microservices with Spring Cloud",
    "course_1_instructor": "John Thompson",
    "course_1_year": "2024",
    "course_2_title": "Docker Fundamentals",
    "course_2_instructor": "Adrian Cantrill",
    "course_2_year": "2024",
    "course_3_title": "Microsoft Azure Fundamentals",
    "course_3_instructor": "Microsoft",
    "course_3_year": "2024",
    "course_4_title": "Angular & NodeJS - The MEAN Stack Guide",
    "course_4_instructor": "Maximilian Schwarzmüller",
    "course_4_year": "2023",
    "certifications_header": "Certifications",
    "certification_1_title": "Professional Scrum Master I Certification",
    "certification_1_instructor": "Scrum.org",
    "certification_1_year": "2023",
    "certification_2_title": "CCNA2: Switching, Routing, and Wireless Essentials",
    "certification_2_instructor": "Cisco",
    "certification_2_year": "2020",
    "contact_header": "Get in touch",
    "contact_phone": "Phone",
    "contact_email": "Email",
    "linkedin": "LinkedIn",
    "github": "GitHub",
    "footer_designed_by": "Designed by Alberto Hernández Lado",
    "footer_rights": "All rights reserved"
}