{
    "title": "Portafolio",
    "home": "Inicio",
    "work_experience": "Experiencia Laboral",
    "education": "Educación",
    "tech_stack": "Tecnologías",
    "courses": "Cursos",
    "certifications": "Certificaciones",
    "contact": "Contacto",
    "profile_name": "Alberto Hernández Lado",
    "profile_role": "ANALISTA PROGRAMADOR",
    "profile_description_1": "Soy analista programador con dos años de experiencia en <strong>Java</strong> y <strong>Spring Boot</strong>, especializado en el diseño y desarrollo aplicaciones web escalables y servicios <strong>RESTful</strong>. A lo largo de mi trayectoria, he trabajado en arquitecturas tanto <strong>monolíticas</strong> como de <strong>microservicios</strong>, diseñando sistemas eficientes y escalables mientras priorizo la escritura de código limpio y documentado, siguiendo las mejores prácticas para asegurar un desarrollo sostenible a largo plazo.",
    "profile_description_2": "Recientemente, he ampliado mis conocimientos hacia el ámbito de <strong>DevOps</strong> para comprender mejor el ciclo completo de desarrollo de software, desde la codificación hasta el despliegue. Estoy adquiriendo conocimientos en <strong>Docker</strong> y <strong>Kubernetes</strong> para la gestión y orquestación de contenedores, así como en la automatización de <strong>pipelines CI/CD</strong> para facilitar la integración y entrega continua.",
    "profile_description_3": "He comenzado a trabajar con plataformas en la nube como <strong>Azure</strong>, donde he desplegado y gestionado servicios en entornos cloud. Mi objetivo es integrar soluciones basadas en la nube en futuros proyectos para construir sistemas altamente escalables y resilientes.",
    "profile_description_4": "Estoy enfocado en seguir especializándome en el diseño de sistemas basados en microservicios y en la implementación de soluciones automatizadas que optimicen tanto la calidad como la eficiencia del software. Me motiva colaborar en equipos dinámicos y participar en proyectos innovadores, mientras continuo aprendiendo y actualizándome con los avances tecnológicos más recientes.",
    "work_experience_header": "Experiencia Laboral",
    "experience_1_company": "imaxin|software",
    "experience_1_role": "Analista programador",
    "experience_1_date": "03/2024 - Actualidad",
    "experience_1_task_1": "Desarrollo e implemento aplicaciones web y servicios RESTful para traducción automática y procesamiento de lenguaje natural.",
    "experience_1_task_2": "Diseñé e implementé un sistema distribuido con servicios RESTful desarrollados en Java Spring Boot y scripts en Python dedicado a la traducción de documentos utilizando modelos de traducción neuronal.",
    "experience_1_task_3": "Desarrollé la lógica de una plataforma de aprendizaje de idiomas para la Universidad de Santiago de Compostela, implementando un sistema de evaluación dinámico con ejercicios de dificultad progresiva. El uso de PostgreSQL, requerido por el cliente, supuso un desafío adicional para la estructura flexible de dichos ejercicios.",
    "experience_1_task_4": "Migré aplicaciones heredadas a Java Spring Boot mediante técnicas de ingeniería inversa.",
    "experience_1_task_5": "Introduje integración continua con GitLab CI, implementando una pipeline para optimizar los procesos de entrega del proyecto.",
    "experience_1_task_6": "Desplegué aplicaciones en servidores Apache Tomcat y WildFly.",
    "experience_1_task_7": "Planifiqué y estimé tareas técnicas para mejorar la eficiencia en la gestión del proyecto.",
    "experience_2_date": "09/2023 - 03/2024",
    "experience_2_company": "NTT Data Europe & Latam",
    "experience_2_role": "Desarrollador Full Stack",
    "experience_2_task_1": "Colaboré en el proyecto de Factoria Software dirigido por la Agencia Digital Andaluza, dedicado a la modernización tecnológica del software de la administración pública, trabajando en distintas aplicaciones web complejas con dominios de datos extensos como Ventanilla Electrónica Andaluza, un portal dedicado a la presentación y tramitación de documentación por parte del ciudadano.",
    "experience_2_task_2": "Desarrollé aplicaciones y servicios web con Spring Boot Java, tanto en arquitecturas monolíticas como en microservicios. Además, utilicé Python para la automatización de tareas, optimizando algunos procesos diarios.",
    "experience_2_task_3": "Desplegué aplicaciones en Apache Tomcat y gestioné el control de versiones con GitFlow.",
    "experience_2_task_4": "Mejoré habilidades de estimación del tiempo dividiendo tareas complejas en pasos concretos, asegurando entregas puntuales.",
    "experience_2_task_5": "Guié a programadores junior, revisando código y proporcionando soporte técnico, fortaleciendo habilidades de liderazgo y comunicación.",
    "experience_3_date": "01/2023 - 06/2023",
    "experience_3_company": "NTT Data Europe & Latam",
    "experience_3_role": "Desarrollador Full Stack",
    "experience_3_task_1": "Participé en el desarrollo de BandeJA, una aplicación web de comunicación interno de la Junta de Andalucía, donde hice uso de JSP, JavaScript y HTML.",
    "experience_3_task_2": "Resolví incidencias técnicas de usuarios, asegurando el funcionamiento continuo del sistema.",
    "education_header": "Educación",
    "education_1_university": "Universidad de Huelva",
    "education_1_degree": "Grado en Ingeniería Informática",
    "education_1_date": "09/2018 - 09/2023",
    "education_2_university": "Politechnika Wrocławska",
    "education_2_degree": "Grado en Ingeniería Informática",
    "education_2_date": "09/2021 - 06/2022",
    "tech_stack_header": "Tecnologías",
    "frameworks": "Frameworks",
    "spring_boot_description": "Con Spring Boot, he desarrollado microservicios y aplicaciones monolíticas escalables, utilizando inyección de dependencias, Spring Data JPA y Spring Security para soluciones seguras y modulares. También he integrado Spring Cloud para arquitecturas nativas de la nube y he usado Maven como gestor de proyectos.",
    "node_js_description": "Trabajé con Node.js, Express.js y Mongoose durante mi proyecto final de grado, desarrollando aplicaciones web y APIs. Planeo seguir explorando Node.js en el futuro.",
    "coding_languages": "Lenguajes de Programación",
    "java_description": "Especializado en backend con Java, he trabajado en múltiples versiones del lenguaje, optimizando rendimiento y diseñando API REST con Programación Orientada a Objetos.",
    "python_description": "Utilicé Python para scripting, automatización y redes neuronales, trabajando con bibliotecas como TensorFlow, PyTorch, Pandas y NumPy.",
    "javascript_description": "Creé aplicaciones web dinámicas con JavaScript y TypeScript, mejorando la experiencia del usuario en diferentes plataformas.",
    "frontend_tools": "Herramientas de frontend",
    "html5_description": "Utilicé HTML5 para estructurar el contenido de las aplicaciones web, aplicando semántica adecuada para mejorar la accesibilidad, el SEO y la mantenibilidad del código.",
    "css3_description": "Empleé CSS3 para diseñar y darle estilo a las interfaces, creando experiencias de usuario atractivas y responsivas mediante técnicas modernas como Flexbox y Grid para adaptabilidad en dispositivos de distintas resoluciones.",
    "thymeleaf_description": "Integré Thymeleaf como motor de plantillas en aplicaciones Spring, facilitando la generación dinámica de contenido en la interfaz, manteniendo una separación clara entre lógica de negocio y presentación, y mejorando la eficiencia en la renderización de páginas.",
    "database_management_systems": "Sistemas de Gestión de Bases de Datos",
    "mysql_description": "Diseñé esquemas de bases de datos y optimicé consultas complejas en MySQL para aplicaciones de alto rendimiento.",
    "oracle_description": "Gestioné bases de datos con Oracle, trabajando con esquemas complejos y consultas avanzadas.",
    "postgresql_description": "Creé bases de datos escalables con PostgreSQL, centrado en rendimiento e integridad de datos.",
    "mongodb_description": "Diseñé soluciones NoSQL con MongoDB para datos no estructurados, optimizando consultas y escalabilidad.",
    "version_control_tools": "Herramientas de Control de Versiones",
    "git_description": "Gestioné repositorios y ramas con Git, implementando Gitflow para estructurar ramificaciones y automatizar procesos.",
    "subversion_description": "Mantuve repositorios de código con Subversion en proyectos heredados.",
    "ci_cd": "CI/CD",
    "gitlab_ci_description": "Automaticé pipelines de integración y despliegue continuo con GitLab CI/CD.",
    "github_actions_description": "Configuré GitHub Actions para automatizar pruebas y despliegues en proyectos personales.",
    "containerization_and_orchestration": "Contenerización y Orquestación",
    "docker_description": "Contenericé aplicaciones con Docker para asegurar consistencia entre entornos y optimizar el desarrollo local.",
    "kubernetes_description": "Orquesté aplicaciones dockerizadas con Kubernetes, mejorando escalabilidad y gestión de recursos.",
    "testing_tools": "Herramientas de Pruebas",
    "junit_description": "Desarrollé pruebas unitarias con JUnit, automatizándolas dentro del pipeline de compilación.",
    "selenium_description": "Automaticé pruebas de integración de aplicaciones web con Selenium WebDriver.",
    "jmeter_description": "Realicé pruebas de carga con JMeter, evaluando el rendimiento de aplicaciones y generando informes detallados.",
    "cloud_platforms": "Plataformas en la Nube",
    "azure_description": "Aprendí conceptos de Microsoft Azure para integrar y desplegar servicios en la nube.",
    "repository_hosting_platforms": "Plataformas de Alojamiento de Repositorios",
    "github_description": "Utilicé GitHub para alojar repositorios y configurar pipelines CI/CD en proyectos personales.",
    "gitlab_description": "Gestioné repositorios y pipelines de CI/CD en proyectos profesionales con GitLab.",
    "project_management_tools": "Herramientas de Gestión de Proyectos",
    "jira_description": "Utilicé Jira para registrar las horas trabajadas en cada tarea, gestionar el estado de las tareas a lo largo del ciclo de vida del proyecto y generar reportes periódicos sobre el avance de las mismas, asegurando que los plazos se cumplieran según lo planeado.",
    "easyredmine_description": "Con Easy Redmine, administré el tiempo dedicado a cada tarea mediante la asignación de horas y el seguimiento del progreso de las mismas. También configuré reportes de avance para asegurar que los proyectos se mantuvieran dentro del calendario previsto.",
    "miscellaneous_tools": "Otras herramientas",
    "bash_description": "Automaticé tareas con Bash/Shell, gestionando configuraciones y despliegues en sistemas Linux como Ubuntu y CentOS.",
    "postman_description": "Usé Postman para probar, depurar y automatizar las pruebas de las API, asegurando que los endpoints cumplieran con los requisitos funcionales y de rendimiento antes de su implementación.",
    "courses_header": "Cursos",
    "course_1_title": "Spring Boot Microservices with Spring Cloud",
    "course_1_instructor": "John Thompson",
    "course_1_year": "2024",
    "course_2_title": "Docker Fundamentals",
    "course_2_instructor": "Adrian Cantrill",
    "course_2_year": "2024",
    "course_3_title": "Microsoft Azure Fundamentals",
    "course_3_instructor": "Microsoft",
    "course_3_year": "2024",
    "course_4_title": "Angular & NodeJS - The MEAN Stack Guide",
    "course_4_instructor": "Maximilian Schwarzmüller",
    "course_4_year": "2023",
    "certifications_header": "Certificaciones",
    "certification_1_title": "Professional Scrum Master I Certification",
    "certification_1_instructor": "Scrum.org",
    "certification_1_year": "2023",
    "certification_2_title": "CCNA2: Switching, Routing, and Wireless Essentials",
    "certification_2_instructor": "Cisco",
    "certification_2_year": "2020",
    "contact_header": "Ponerse en contacto",
    "contact_phone": "Teléfono",
    "contact_email": "Correo Electrónico",
    "linkedin": "LinkedIn",
    "github": "GitHub",
    "footer_designed_by": "Diseñado por Alberto Hernández Lado",
    "footer_rights": "Todos los derechos reservados"
}
